package com.fear.healthrecord.myunitls;

import java.util.HashMap;
import java.util.Map;
import java.util.Random;

public class NameGen {
    public static String createname(){
        StringBuffer name=new StringBuffer(0);
        String first="赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许" +
                "何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章" +
                "云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳" +
                "酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常" +
                "乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹" +
                "姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞" +
                "熊纪舒屈项祝董粱杜阮蓝闵席季麻强贾路娄危" +
                "江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍" +
                "虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓" +
                "郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁" +
                "荀羊於惠甄麴家封芮羿储靳汲邴糜松井段富巫" +
                "乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫" +
                "宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶" +
                "郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙" +
                "池乔阴欎胥能苍双闻莘党翟谭贡劳逄姬申扶堵" +
                "冉宰郦雍舄璩桑桂濮牛寿通边扈燕冀郏浦尚农" +
                "温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎" +
                "戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东" +
                "殴殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚" +
                "那简饶空曾毋沙乜养鞠须丰巢关蒯相查後荆红" +
                "游竺权逯盖益桓公";
        String last="文明华志伟玉晓国建平杰云海芳丽林英德佳红永宇荣俊君子军家龙慧秀玲成东婷世宏新嘉敏立雅庆辉美瑞安祥清峰" +
                "梅怡惠欣正忠元维燕强凤智萍佩良凯艳兰兴振娟彦仁雪淑学珍静如青中宗思利霞民福天宝玮昌斌飞秋胜雯鹏颖少勇铭" +
                "洪贤宜波芬超宁亮哲鸿翔豪松琳一浩洁江泽长群莹桂瑜琪义莉琴庭涛政富贵轩涵恩雨书柏阳健旭刚廷圣培月景仪启博" +
                "士全孟锋爱远蓉彬友香广威耀承钧武达山坤伦诗逸毅珊锦升方顺和郁源雄星钰娜汉冠心信丹绍梦茹鑫霖继芸真容琼莲" +
                "晨发萱盈芝慈婉恒传琦素佑奇吉奕朝巧兵睿根兆仲翠儒勋才益康昱倩馨扬祖进先敬薇裕媛克毓连凡洋丰诚弘璇翰茂南" +
                "纯有万贞皓喜盛菁孝筱均靖辰其乐依修若力延权亭羽菊伯淳泉晴妮泰昭桦旻崇虹宪咏勤章仕之湘尚道钦聪为可川开碧" +
                "品姿骏双礼尧瑄纬炳楠凌柔高秉沛怀卿岳韦于绮麟昕治妤竹晋隆磊瑶韵伊程蕙昀善运风炜希科翊然珠晶冰焕任娇名来" +
                "虎筠乔妍谦祯帆祐宣展栋易晖舒婕峻向旺邦艺跃玟致芹芷亦昆业曼加以增显铃鸣闵意汝迪宛千祺灵彤娴岚捷守奎泓丞" +
                "洲玫京硕腾本菲年瑛茜瑾姗舜懿润雷渊乃悦齐堂紫航宽甫煜至原臻朋城人蓁苹卓琬幸坚瀚同俐蕾登蔚纪岩卉禹楷微镇" +
                "寿蓓璐雁忆采昊欢晟占西恺尹融甄露惟存楚茵念琇梓太震汶谊相灿熙鼎能谕路得菱允宸照翎淇煌行婧言黎钟夫屏柱斐" +
                "杨百彪厚铨炎圆麒自贝竣河笑久时声滨璟法彰桓又呈玄亿令标常迎纹苗恬渝音理小韶函典上枫瑀津梁媚作岱语余岑重" +
                "献琮鹤劭羿禄萌尔介烨夏锐绪滢艾肇巍征苓合佐榆晔唯劲曜经侑曦珈苑葳格予越从贺赛姵姣钊衍铮嵩澄霆功歆魁霈馥" +
                "幼蕊训蒙昶姝前侠寒芯聿桐潇非颐苇端玺琛喻影谷炫含则胤盼里乾济慕砚骅申肖玥芃暄樱崴芊珺纮霜敦逢净再禾耘浚" +
                "起多沂寅知苡菀庚牧骐沁茗化复誉隽资殿孜普仰靓雍懋炯嫣韬珂联旋忻薰昂寰祈琨贻望霓冲必沅述召颂俪盟愉翼薏赞" +
                "芮荷铠北谨蓝秦珏律繁霄慎玠闻洛涓濬杉倍诺蕴轶在淼眉效珩柯冉璧嬿镜霏璞颢甲曙御右实翌严啸丝今铎蔓峥颉朗深" +
                "菡晗稚焱赫丛侃嵘优仑祎竞璁谋莺辛井缘熹灏炘汇芙珣倚彧圻策芩证畅屹临戎琰享偲驰惇励漫漪诠助步竺黛弼沐陶钲" +
                "后图葵佾领霙曾吾贯榛积朴奂凝澍莞默睦施竑诒锴夙丕温习滔鹃溥璨拓际骞冀澜葆颀煦襄湄谆湛诣栩嗣箴俏姮玹羲霁" +
                "熠迅缙瑢镕淙荟擎枢萃喆瑷佰悠尤祉岸憬晞朔缇异旖孚忱彻择纾镛镐莳识梧鋆旎衿禛恪俨濡粲惜琢蔼旼铂嬛郅蘅兢企" +
                "谟飒楙炅近帼闰矞藜瞻湉遐慷苒衢铄稔玙挚诤";
        Random random=new Random();
        int flag=random.nextInt(2);
        if(flag%2==0) {
            int n1 = random.nextInt(first.length());
            name.append(first.charAt(n1));
            int n2 = random.nextInt(last.length());
            name.append(last.charAt(n2));
            int n3 = random.nextInt(last.length());
            name.append(last.charAt(n3));
        }
        else  {
            int n1 = random.nextInt(first.length());
            name.append(first.charAt(n1));
            int n2 = random.nextInt(last.length());
            name.append(last.charAt(n2));
        }

        return name.toString();
    }

}
